denisbohm/firefly-ice-firmware/src/nrf5/fd_ble_nrf5.c
#include "fd_ble.h"

#ifdef SOFTDEVICE_PRESENT

#pragma GCC diagnostic push

#pragma GCC diagnostic ignored "-Wold-style-declaration"
#pragma GCC diagnostic ignored "-Wsign-compare"
#pragma GCC diagnostic ignored "-Wunused-parameter"
#pragma GCC diagnostic ignored "-Wsign-conversion"
#pragma GCC diagnostic ignored "-Wconversion"

#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_bas.h"
#include "ble_conn_params.h"
#include "ble_dis.h"
#include "ble_gatts.h"

#include "nrf_ble_gatt.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_soc.h"

#include "app_scheduler.h"
#include "app_timer.h"

#pragma GCC diagnostic pop

#include <stdint.h>
#include <string.h>

#define FD_BLE_SERVICE_LIMIT 4
#define FD_BLE_CHARACTERISTICS_LIMIT 16
#define FD_BLE_CHANNEL_LIMIT 4

typedef struct {
    ble_gatts_char_handles_t handles;
    bool is_notification_enabled;
} fd_ble_characteristic_nrf5_t;

typedef struct {
    fd_ble_service_t *service;
    uint8_t uuid_type;
    uint16_t service_handle;
    fd_ble_characteristic_nrf5_t characteristics[FD_BLE_CHARACTERISTICS_LIMIT];
} fd_ble_service_nrf5_t;

typedef struct {
    fd_ble_l2cap_channel_t *channel;
    uint16_t local_cid;
    uint8_t stream_read_data[300];
    uint32_t stream_read_offset;
    uint32_t stream_read_length;
    uint8_t stream_write_data[300];
} fd_ble_l2cap_channel_nrf5_t;

#define APP_BLE_CONN_CFG_TAG 1

fd_ble_configuration_t *fd_ble_configuration;
fd_ble_service_nrf5_t fd_ble_services[FD_BLE_SERVICE_LIMIT];
uint32_t fd_ble_services_count;
fd_ble_l2cap_channel_nrf5_t fd_ble_channels[FD_BLE_CHANNEL_LIMIT];
uint32_t fd_ble_channel_count;
uint8_t fd_ble_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
uint8_t fd_ble_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];
uint8_t fd_ble_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];
ble_gap_adv_data_t fd_ble_adv_data =
{
    .adv_data =
    {
        .p_data = fd_ble_enc_advdata,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
    },
    .scan_rsp_data =
    {
        .p_data = fd_ble_enc_scan_response_data,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX

    }
};
uint16_t fd_ble_conn_handle = BLE_CONN_HANDLE_INVALID;
uint32_t fd_ble_data_credits;

#define FD_BLE_GATT_ATT_MTU_MAX 247
//#define FD_BLE_GATT_ATT_MTU_MAX 23

const uint8_t rx_queue_size = 1;

ble_gap_sec_keyset_t ble_gap_sec_keyset;
ble_gap_conn_params_t ble_gap_conn_params;
ble_gap_evt_auth_status_t ble_gap_evt_auth_status;
ble_gap_evt_phy_update_t ble_gap_evt_phy_update;
ble_gap_data_length_params_t ble_gap_data_length_params;
ble_l2cap_evt_ch_setup_request_t ble_l2cap_evt_ch_setup_request;
ble_l2cap_evt_ch_setup_refused_t ble_l2cap_evt_ch_setup_refused;
ble_l2cap_evt_ch_setup_t ble_l2cap_evt_ch_setup;
ble_l2cap_evt_ch_rx_t ble_l2cap_evt_ch_rx;
uint32_t ble_l2cap_evt_ch_rx_sdu_len_max;
ble_data_t last_tx_sdu;
ble_l2cap_evt_ch_tx_t ble_l2cap_evt_ch_tx;
ble_l2cap_evt_ch_credit_t ble_l2cap_evt_ch_credit;
ble_gatts_evt_exchange_mtu_request_t ble_gatts_evt_exchange_mtu_request;
ble_gattc_evt_exchange_mtu_rsp_t ble_gattc_evt_exchange_mtu_rsp;

uint32_t fd_assert_fail_count = 0;

void fd_assert_fail(const char *message __attribute__((unused))) {
    ++fd_assert_fail_count;
}

#if 0
void app_error_handler(uint32_t error_code, uint32_t line_num __attribute__((unused)), const uint8_t *p_file_name __attribute__((unused))) {
    char buffer[16];
    sprintf(buffer, "app 0x%08x", (unsigned int)error_code);
    fd_assert_fail(buffer);
}
#endif

void app_error_handler_bare(uint32_t error_code) {
    char buffer[16];
    sprintf(buffer, "app 0x%08x", (unsigned int)error_code);
    fd_assert_fail(buffer);
}

void app_error_fault_handler(uint32_t FD_UNUSED id, uint32_t pc, uint32_t FD_UNUSED info) {
    char buffer[16];
    sprintf(buffer, "app 0x%08x", (unsigned int)pc);
    fd_assert_fail(buffer);
}

bool fd_ble_is_connected(void) {
    return fd_ble_conn_handle != BLE_CONN_HANDLE_INVALID;
}

uint32_t fd_ble_get_data_credits(void) {
    return fd_ble_data_credits;
}

bool fd_ble_has_data_credits(void) {
    return fd_ble_get_data_credits() > 0;
}

fd_ble_characteristic_nrf5_t *fd_ble_get_characteristic_nrf5(uint16_t uuid) {
    for (uint32_t i = 0; i < fd_ble_configuration->service_count; ++i) {
        fd_ble_service_nrf5_t *service_nrf5 = &fd_ble_services[i];
        for (uint32_t j = 0; j < service_nrf5->service->characteristics_count; ++j) {
            fd_ble_characteristic_t *characteristic = &service_nrf5->service->characteristics[j];
            if (characteristic->uuid == uuid) {
                fd_ble_characteristic_nrf5_t *characteristic_nrf5 = &service_nrf5->characteristics[j];
                return characteristic_nrf5;
            }
        }
    }
    return 0;
}

bool fd_ble_set_characteristic_value(uint16_t uuid, uint8_t *value, uint32_t length) {
    if (!fd_ble_is_connected()) {
        return false;
    }
    fd_ble_characteristic_nrf5_t *characteristic_nrf5 = fd_ble_get_characteristic_nrf5(uuid);
    ble_gatts_hvx_params_t hvx_params;
    memset(&hvx_params, 0, sizeof(hvx_params));
    hvx_params.handle = characteristic_nrf5->handles.value_handle;
    hvx_params.p_data = value;
    uint16_t len = (uint16_t)length;
    hvx_params.p_len  = &len;
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
    uint32_t err_code = sd_ble_gatts_hvx(fd_ble_conn_handle, &hvx_params);
    APP_ERROR_CHECK(err_code);
    if (fd_ble_data_credits > 0) {
        --fd_ble_data_credits;
    }
    return true;
}

void fd_ble_gap_set_device_name(void) {
    ble_gap_conn_sec_mode_t sec_mode;
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    uint8_t *name = fd_ble_configuration->name;
    uint16_t length = (uint16_t)strlen((char *)name);
    uint32_t err_code = sd_ble_gap_device_name_set(&sec_mode, name, length);
    APP_ERROR_CHECK(err_code);
}

static ble_gap_conn_params_t fd_ble_gap_conn_params(void) {
    ble_gap_conn_params_t gap_conn_params;
    memset(&gap_conn_params, 0, sizeof(gap_conn_params));
    gap_conn_params.min_conn_interval = 12; // 12 == 15 ms (1.25 ms units)
    gap_conn_params.max_conn_interval = 12; // 12 == 15 ms (1.25 ms units)
    gap_conn_params.slave_latency = 0;
    gap_conn_params.conn_sup_timeout = 400; // 4 s (10 ms units)
    return gap_conn_params;
}

void fd_ble_gap_params_initialize(void) {
    fd_ble_gap_set_device_name();

    // store the actual results here so we can verify the change. -denis
    memset(&ble_gap_conn_params, 0, sizeof(ble_gap_conn_params));

    ble_gap_conn_params_t gap_conn_params = fd_ble_gap_conn_params();
    uint32_t err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

