denisbohm/firefly-ice-firmware/src/nrf5/fd_ble_nrf5.c
NRF_BLE_GATT_DEF(fd_ble_gatt);

void fd_ble_gap_initialize(void) {
    ret_code_t err_code = nrf_ble_gatt_init(&fd_ble_gatt, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_periph_set(&fd_ble_gatt, FD_BLE_GATT_ATT_MTU_MAX);
    APP_ERROR_CHECK(err_code);
}

uint32_t fd_ble_service_add_characteristic(
    fd_ble_service_nrf5_t *service_nrf5,
    fd_ble_characteristic_nrf5_t *characteristic_nrf5,
    fd_ble_characteristic_t *characteristic
) {
    ble_gatts_char_md_t char_md;
    ble_gatts_attr_md_t cccd_md;
    ble_gatts_attr_t    attr_char_value;
    ble_uuid_t          ble_uuid;
    ble_gatts_attr_md_t attr_md;
    
    memset(&cccd_md, 0, sizeof(cccd_md));

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);

    cccd_md.vloc = BLE_GATTS_VLOC_STACK;
    
    memset(&char_md, 0, sizeof(char_md));
    
    uint32_t flags = characteristic->flags;
    char_md.char_props.write  = (uint8_t) (flags & FD_BLE_CHARACTERISTIC_FLAG_WRITE ? 1 : 0);
    char_md.char_props.write_wo_resp = (uint8_t) (flags & FD_BLE_CHARACTERISTIC_FLAG_WRITE_WITHOUT_RESPONSE ? 1 : 0);
    char_md.char_props.notify = (uint8_t) (flags & FD_BLE_CHARACTERISTIC_FLAG_NOTIFY ? 1 : 0);
    char_md.p_char_user_desc  = NULL;
    char_md.p_char_pf         = NULL;
    char_md.p_user_desc_md    = NULL;
    char_md.p_cccd_md         = &cccd_md;
    char_md.p_sccd_md         = NULL;
    
    ble_uuid.type             = service_nrf5->uuid_type;
    ble_uuid.uuid             = characteristic->uuid;
    
    memset(&attr_md, 0, sizeof(attr_md));

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);
    
    attr_md.vloc              = BLE_GATTS_VLOC_STACK;
    attr_md.rd_auth           = 0;
    attr_md.wr_auth           = 0;
    attr_md.vlen              = 1;
    
    memset(&attr_char_value, 0, sizeof(attr_char_value));

    attr_char_value.p_uuid    = &ble_uuid;
    attr_char_value.p_attr_md = &attr_md;
    attr_char_value.init_len  = sizeof(uint8_t);
    attr_char_value.init_offs = 0;
    attr_char_value.max_len   = 20;
    
    uint32_t err_code = sd_ble_gatts_characteristic_add(service_nrf5->service_handle, &char_md, &attr_char_value, &characteristic_nrf5->handles);
    APP_ERROR_CHECK(err_code);
    return err_code;
}

void fd_ble_service_initialize(fd_ble_service_nrf5_t *service_nrf5, fd_ble_service_t *service) {
    service_nrf5->service = service;

    ble_uuid128_t base_uuid;
    memcpy(base_uuid.uuid128, service->base_uuid, 16);
    uint32_t err_code = sd_ble_uuid_vs_add(&base_uuid, &service_nrf5->uuid_type);
    APP_ERROR_CHECK(err_code);

    ble_uuid_t ble_uuid;
    ble_uuid.type = service_nrf5->uuid_type;
    ble_uuid.uuid = service->uuid;
    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &ble_uuid, &service_nrf5->service_handle);
    APP_ERROR_CHECK(err_code);

    for (uint32_t i = 0; i < service->characteristics_count; ++i) {
        fd_ble_characteristic_t *characteristic = &service->characteristics[i];
        fd_ble_characteristic_nrf5_t *characteristic_nrf5 = &service_nrf5->characteristics[i];
        fd_ble_service_add_characteristic(service_nrf5, characteristic_nrf5, characteristic);
    }
}

void fd_ble_services_initialize(fd_ble_service_t *services, uint32_t services_count) {
    fd_ble_services_count = services_count;
    for (uint32_t i = 0; i < services_count; ++i) {
        fd_ble_service_initialize(&fd_ble_services[i], &services[i]);
    }
}

void fd_ble_advertising_initialize(void) {
    ble_advdata_t advdata;
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    ble_uuid_t adv_uuids[] = {{fd_ble_services[0].service->uuid, fd_ble_services[0].uuid_type}};

    advdata.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
    advdata.uuids_complete.p_uuids = adv_uuids;
    uint8_t encoded[32];
    uint16_t encoded_length = sizeof(encoded);
    uint32_t err_code = ble_advdata_encode(&advdata, encoded, &encoded_length);
    APP_ERROR_CHECK(err_code);
}

void fd_ble_advertising_start(void) {
    fd_ble_service_nrf5_t *service_nrf5 = &fd_ble_services[0];
    ble_uuid_t adv_uuids[] = {
        {
            .uuid = service_nrf5->service->uuid,
            .type = service_nrf5->uuid_type
        }
    };
    ble_advdata_t adv_data = {
        .name_type = BLE_ADVDATA_FULL_NAME,
        .include_appearance = false,
        .flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE,
        .uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]),
        .uuids_complete.p_uuids = adv_uuids,
    };
    uint32_t err_code = ble_advdata_encode(&adv_data, fd_ble_adv_data.adv_data.p_data, &fd_ble_adv_data.adv_data.len);
    APP_ERROR_CHECK(err_code);

    ble_gap_adv_params_t adv_params = {
        .primary_phy     = BLE_GAP_PHY_1MBPS,
        .duration        = BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED,
        .properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED,
        .p_peer_addr     = NULL,
        .filter_policy   = BLE_GAP_ADV_FP_ANY,
        .interval        = 400 // 250 ms (0.625 ms units)
    };

    err_code = sd_ble_gap_adv_set_configure(&fd_ble_adv_handle, &fd_ble_adv_data, &adv_params);
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_adv_start(fd_ble_adv_handle, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);
}

void fd_ble_evt_user_mem_request(ble_evt_t const FD_UNUSED *p_ble_evt) {
    sd_ble_user_mem_reply(fd_ble_conn_handle, NULL);
}

void fd_ble_evt_user_mem_release(ble_evt_t const FD_UNUSED *p_ble_evt) {
}

void fd_ble_gap_evt_connected(ble_evt_t const *p_ble_evt) {
    fd_ble_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;

    ble_gap_conn_params_t gap_conn_params = fd_ble_gap_conn_params();
    uint32_t err_code = sd_ble_gap_conn_param_update(fd_ble_conn_handle, &gap_conn_params);
    APP_ERROR_CHECK(err_code);

