denisbohm/firefly-ice-firmware/src/nrf5/fd_ble_nrf5.c
    fd_ble_data_credits = BLE_GATTS_HVN_TX_QUEUE_SIZE_DEFAULT;

    err_code = sd_ble_gatts_sys_attr_set(fd_ble_conn_handle, NULL, 0, 0);
    APP_ERROR_CHECK(err_code);
}

void fd_ble_gap_evt_disconnected(ble_evt_t const FD_UNUSED *p_ble_evt) {
    fd_ble_conn_handle = BLE_CONN_HANDLE_INVALID;
    fd_ble_data_credits = 0;

    fd_ble_advertising_start();
}

void fd_ble_gap_evt_conn_param_update(ble_evt_t const *p_ble_evt) {
    ble_gap_conn_params = p_ble_evt->evt.gap_evt.params.conn_param_update.conn_params;
}

void fd_ble_gap_evt_sec_params_request(ble_evt_t const FD_UNUSED *p_ble_evt) {
    memset(&ble_gap_sec_keyset, 0, sizeof(ble_gap_sec_keyset));
    ble_gap_sec_params_t m_sec_params;
    m_sec_params.bond         = 1;
    m_sec_params.mitm         = 0;
    m_sec_params.io_caps      = BLE_GAP_IO_CAPS_NONE;
    m_sec_params.oob          = 0;  
    m_sec_params.min_key_size = 7;
    m_sec_params.max_key_size = 16;
    uint32_t err_code = sd_ble_gap_sec_params_reply(fd_ble_conn_handle, BLE_GAP_SEC_STATUS_SUCCESS, &m_sec_params, &ble_gap_sec_keyset);
    APP_ERROR_CHECK(err_code);
}

void fd_ble_gatts_evt_sys_attr_missing(ble_evt_t const FD_UNUSED *p_ble_evt) {
    uint32_t err_code = sd_ble_gatts_sys_attr_set(fd_ble_conn_handle, NULL, 0, 0);
    APP_ERROR_CHECK(err_code);
}

void fd_ble_gap_evt_auth_status(ble_evt_t const *p_ble_evt) {
    ble_gap_evt_auth_status = p_ble_evt->evt.gap_evt.params.auth_status;
}

void fd_ble_gap_evt_sec_info_request(ble_evt_t const FD_UNUSED *p_ble_evt) {
    uint32_t err_code = sd_ble_gap_sec_info_reply(fd_ble_conn_handle, NULL, NULL, NULL);
    APP_ERROR_CHECK(err_code);
}

void fd_ble_gatts_evt_hvn_tx_complete(ble_evt_t const *p_ble_evt) {
    uint8_t count = p_ble_evt->evt.gatts_evt.params.hvn_tx_complete.count;
    fd_ble_data_credits += count;
}

void fd_ble_gap_evt_phy_update_request(ble_evt_t const *p_ble_evt) {
    ble_gap_phys_t phys = {BLE_GAP_PHY_AUTO, BLE_GAP_PHY_AUTO};
    sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
}

void fd_ble_gap_evt_phy_update(ble_evt_t const *p_ble_evt) {
    ble_gap_evt_phy_update = p_ble_evt->evt.gap_evt.params.phy_update;
    // BLE_GAP_PHY_2MBPS == 2
}

void fd_ble_gap_evt_data_length_update_request(ble_evt_t const *p_ble_evt) {
    ble_gap_data_length_params_t params;
    // Clearing the struct will effectivly set members to BLE_GAP_DATA_LENGTH_AUTO
    memset(&params, 0, sizeof(params));
    uint32_t err_code = sd_ble_gap_data_length_update(p_ble_evt->evt.gap_evt.conn_handle, &params, 0);
    APP_ERROR_CHECK(err_code);
}

void fd_ble_gap_evt_data_length_update(ble_evt_t const *p_ble_evt) {
    ble_gap_data_length_params = p_ble_evt->evt.gap_evt.params.data_length_update.effective_params;
}

bool fd_ble_l2cap_channel_stream_is_read_available(fd_ble_l2cap_channel_t *channel) {
    return channel->read_available;
}

fd_ble_l2cap_channel_nrf5_t *fd_ble_l2cap_channel_nrf5_for_psm(uint16_t psm) {
    for (uint32_t i = 0; i < fd_ble_channel_count; ++i) {
        fd_ble_l2cap_channel_nrf5_t *channel_nrf5 = &fd_ble_channels[i];
        if (channel_nrf5->channel->protocol_service_multiplexer == psm) {
            return channel_nrf5;
        }
    }
    return 0;
}

fd_ble_l2cap_channel_nrf5_t *fd_ble_l2cap_channel_nrf5_for_local_cid(uint16_t local_cid) {
    for (uint32_t i = 0; i < fd_ble_channel_count; ++i) {
        fd_ble_l2cap_channel_nrf5_t *channel_nrf5 = &fd_ble_channels[i];
        if (channel_nrf5->local_cid == local_cid) {
            return channel_nrf5;
        }
    }
    return 0;
}

fd_ble_l2cap_channel_nrf5_t *fd_ble_l2cap_channel_nrf5_for_l2cap_channel(fd_ble_l2cap_channel_t *l2cap_channel) {
    for (uint32_t i = 0; i < fd_ble_channel_count; ++i) {
        fd_ble_l2cap_channel_nrf5_t *channel_nrf5 = &fd_ble_channels[i];
        if (channel_nrf5->channel == l2cap_channel) {
            return channel_nrf5;
        }
    }
    return 0;
}

void fd_ble_setup_l2cap_rx(fd_ble_l2cap_channel_nrf5_t *channel_nrf5) {
    channel_nrf5->stream_read_offset = 0;
    channel_nrf5->stream_read_length = 0;
    ble_data_t sdu = {
        .p_data = channel_nrf5->stream_read_data,
        .len = sizeof(channel_nrf5->stream_read_data)
    };
    uint32_t err_code = sd_ble_l2cap_ch_rx(fd_ble_conn_handle, channel_nrf5->local_cid, &sdu);
    APP_ERROR_CHECK(err_code);
}

uint32_t fd_ble_l2cap_channel_stream_read(fd_ble_l2cap_channel_t *channel, uint8_t *data, uint32_t length) {
    fd_ble_l2cap_channel_nrf5_t *channel_nrf5 = fd_ble_l2cap_channel_nrf5_for_l2cap_channel(channel);
    uint32_t n = channel_nrf5->stream_read_length;
    if (n > length) {
        n = length;
    }
    memcpy(data, &channel_nrf5->stream_read_data[channel_nrf5->stream_read_offset], n);
    channel_nrf5->stream_read_length -= n;
    if (channel_nrf5->stream_read_length == 0) {
        channel->read_available = false;
        fd_ble_setup_l2cap_rx(channel_nrf5);
    }
    return n;
}

bool fd_ble_l2cap_channel_stream_is_write_available(fd_ble_l2cap_channel_t *channel) {
    return channel->write_available;
}

uint32_t fd_ble_l2cap_channel_stream_write(fd_ble_l2cap_channel_t *channel, uint8_t *data, uint32_t length) {
    fd_ble_l2cap_channel_nrf5_t *channel_nrf5 = fd_ble_l2cap_channel_nrf5_for_l2cap_channel(channel);
    uint32_t len = sizeof(channel_nrf5->stream_write_data);
    if (len > length) {
        len = length;
    }
    ble_data_t sdu = {
        .p_data = channel_nrf5->stream_write_data,
        .len = (uint16_t)len
    };
    memcpy(channel_nrf5->stream_write_data, data, len);
    uint32_t err_code = sd_ble_l2cap_ch_tx(fd_ble_conn_handle, channel_nrf5->local_cid, &sdu);
    APP_ERROR_CHECK(err_code);
    channel->write_available = false;
    return len;
}

void fd_ble_l2cap_initialize(void) {
    ble_l2cap_evt_ch_rx_sdu_len_max = 0;
}

void fd_ble_l2cap_evt_ch_setup_request(ble_evt_t const *p_ble_evt) {
    ble_l2cap_evt_ch_setup_request = p_ble_evt->evt.l2cap_evt.params.ch_setup_request;
    fd_ble_l2cap_channel_nrf5_t *channel_nrf5 = fd_ble_l2cap_channel_nrf5_for_psm(ble_l2cap_evt_ch_setup_request.le_psm);
    // !!! reject if channel not found for that psm -denis
    channel_nrf5->local_cid = p_ble_evt->evt.l2cap_evt.local_cid;
    ble_l2cap_ch_setup_params_t ch_setup_params;
    memset(&ch_setup_params, 0, sizeof(ch_setup_params));
    ch_setup_params.le_psm = ble_l2cap_evt_ch_setup_request.le_psm;
    ch_setup_params.status = BLE_L2CAP_CH_STATUS_CODE_SUCCESS;
    ch_setup_params.rx_params.rx_mtu = BLE_L2CAP_MTU_MIN;
    ch_setup_params.rx_params.rx_mps = BLE_L2CAP_MPS_MIN;
    ch_setup_params.rx_params.sdu_buf = (ble_data_t){ .p_data = 0, .len = 0 };
    uint32_t err_code = sd_ble_l2cap_ch_setup(p_ble_evt->evt.l2cap_evt.conn_handle, &channel_nrf5->local_cid, &ch_setup_params);
    APP_ERROR_CHECK(err_code);
}

void fd_ble_l2cap_evt_ch_setup_refused(ble_evt_t const *p_ble_evt) {
    ble_l2cap_evt_ch_setup_refused = p_ble_evt->evt.l2cap_evt.params.ch_setup_refused;
}

