denisbohm/firefly-ice-firmware/src/nrf5/fd_ble_nrf5.c
void fd_ble_l2cap_evt_ch_setup(ble_evt_t const *p_ble_evt) {
    fd_ble_l2cap_channel_nrf5_t *channel_nrf5 = fd_ble_l2cap_channel_nrf5_for_local_cid(p_ble_evt->evt.l2cap_evt.local_cid);
    ble_l2cap_evt_ch_setup = p_ble_evt->evt.l2cap_evt.params.ch_setup;

    fd_ble_l2cap_initialize();

    fd_ble_setup_l2cap_rx(channel_nrf5);

    fd_ble_l2cap_channel_t *channel = &fd_ble_configuration->channels[0];
    channel->on_open(channel);
}

void fd_ble_l2cap_evt_ch_released(ble_evt_t const *p_ble_evt) {
    fd_ble_l2cap_channel_nrf5_t *channel_nrf5 = fd_ble_l2cap_channel_nrf5_for_local_cid(p_ble_evt->evt.l2cap_evt.local_cid);
    channel_nrf5->local_cid = 0;

    fd_ble_l2cap_channel_t *channel = &fd_ble_configuration->channels[0];
    channel->on_close(channel);
}

void fd_ble_l2cap_evt_ch_rx(ble_evt_t const *p_ble_evt) {
    fd_ble_l2cap_channel_nrf5_t *channel_nrf5 = fd_ble_l2cap_channel_nrf5_for_local_cid(p_ble_evt->evt.l2cap_evt.local_cid);
    ble_l2cap_evt_ch_rx = p_ble_evt->evt.l2cap_evt.params.rx;
    ble_data_t FD_UNUSED sdu_buf = p_ble_evt->evt.l2cap_evt.params.rx.sdu_buf;
    uint16_t len = p_ble_evt->evt.l2cap_evt.params.rx.sdu_len;
    if (len > ble_l2cap_evt_ch_rx_sdu_len_max) {
        ble_l2cap_evt_ch_rx_sdu_len_max = len;
    }

    channel_nrf5->stream_read_offset = 0;
    channel_nrf5->stream_read_length = len;

    fd_ble_l2cap_channel_t *channel = channel_nrf5->channel;
    channel->read_available = true;
    channel->on_read_available(channel);
}

void fd_ble_l2cap_evt_ch_tx(ble_evt_t const *p_ble_evt) {
    uint16_t local_cid = p_ble_evt->evt.l2cap_evt.local_cid;
    fd_ble_l2cap_channel_nrf5_t *channel_nrf5 = fd_ble_l2cap_channel_nrf5_for_local_cid(local_cid);

    ble_l2cap_evt_ch_tx = p_ble_evt->evt.l2cap_evt.params.tx;
    ble_data_t FD_UNUSED sdu_buf = p_ble_evt->evt.l2cap_evt.params.tx.sdu_buf;

    fd_ble_l2cap_channel_t *channel = channel_nrf5->channel;
    channel->write_available = true;
    channel->on_write_available(channel);
}

void fd_ble_l2cap_evt_ch_credit(ble_evt_t const *p_ble_evt) {
    ble_l2cap_evt_ch_credit = p_ble_evt->evt.l2cap_evt.params.credit;
    // send more data...
}

// tx or rx buffer released (typically when channel is closed)
void fd_ble_l2cap_evt_ch_sdu_buf_released(ble_evt_t const *p_ble_evt) {
    ble_data_t FD_UNUSED sdu_buf = p_ble_evt->evt.l2cap_evt.params.ch_sdu_buf_released.sdu_buf;
}

void fd_ble_gatts_evt_exchange_mtu_request(ble_evt_t const *p_ble_evt) {
    ble_gatts_evt_exchange_mtu_request = p_ble_evt->evt.gatts_evt.params.exchange_mtu_request;
    uint16_t FD_UNUSED conn_handle = p_ble_evt->evt.gatts_evt.conn_handle;
    uint16_t client_rx_mtu = p_ble_evt->evt.gatts_evt.params.exchange_mtu_request.client_rx_mtu;
    if (client_rx_mtu > FD_BLE_GATT_ATT_MTU_MAX) {
        client_rx_mtu = FD_BLE_GATT_ATT_MTU_MAX;
    }
// !!! this causes an exception - why? -denis
//    uint32_t err_code = sd_ble_gatts_exchange_mtu_reply(conn_handle, client_rx_mtu);
//    APP_ERROR_CHECK(err_code);
}

void fd_ble_gattc_evt_exchange_mtu_rsp(ble_evt_t const *p_ble_evt) {
    ble_gattc_evt_exchange_mtu_rsp = p_ble_evt->evt.gattc_evt.params.exchange_mtu_rsp;
}

void fd_ble_gatts_evt_write(ble_evt_t const *p_ble_evt) {
    const ble_gatts_evt_write_t *p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
    for (uint32_t i = 0; i < fd_ble_services_count; ++i) {
        fd_ble_service_nrf5_t *service_nrf5 = &fd_ble_services[i];
        for (uint32_t j = 0; j < service_nrf5->service->characteristics_count; ++j) {
            fd_ble_characteristic_nrf5_t *characteristic_nrf5 = &service_nrf5->characteristics[j];
            if ((p_evt_write->handle == characteristic_nrf5->handles.cccd_handle) && (p_evt_write->len == 2)) {
                characteristic_nrf5->is_notification_enabled = ble_srv_is_notification_enabled(p_evt_write->data);
                return;
            } else
            if (p_evt_write->handle == characteristic_nrf5->handles.value_handle) {
                fd_ble_characteristic_t *characteristic = &service_nrf5->service->characteristics[j];
                if (characteristic->value_handler) {
                    characteristic->value_handler(characteristic->uuid, p_evt_write->data, p_evt_write->len);
                }
                return;
            }
        }
    }
}

void fd_ble_on_ble_evt(ble_evt_t const *p_ble_evt) {
    switch (p_ble_evt->header.evt_id) {
        case BLE_EVT_USER_MEM_REQUEST: {
            fd_ble_evt_user_mem_request(p_ble_evt);
        } break;
        case BLE_EVT_USER_MEM_RELEASE: {
            fd_ble_evt_user_mem_release(p_ble_evt);
        } break;
        case BLE_GAP_EVT_CONNECTED: {
            fd_ble_gap_evt_connected(p_ble_evt);
        } break;
        case BLE_GAP_EVT_DISCONNECTED: {
            fd_ble_gap_evt_disconnected(p_ble_evt);
        } break;
        case BLE_GAP_EVT_CONN_PARAM_UPDATE: {
            fd_ble_gap_evt_conn_param_update(p_ble_evt);
        } break;
        case BLE_GAP_EVT_SEC_PARAMS_REQUEST: {
            fd_ble_gap_evt_sec_params_request(p_ble_evt);
        } break;
        case BLE_GATTS_EVT_SYS_ATTR_MISSING: {
            fd_ble_gatts_evt_sys_attr_missing(p_ble_evt);
        } break;
        case BLE_GAP_EVT_AUTH_STATUS: {
            fd_ble_gap_evt_auth_status(p_ble_evt);
        } break;
        case BLE_GAP_EVT_SEC_INFO_REQUEST: {
            fd_ble_gap_evt_sec_info_request(p_ble_evt);
        } break;
        case BLE_GATTS_EVT_HVN_TX_COMPLETE: {
            fd_ble_gatts_evt_hvn_tx_complete(p_ble_evt);
        } break;
        case BLE_GATTS_EVT_WRITE: {
            fd_ble_gatts_evt_write(p_ble_evt);
        } break;
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
            fd_ble_gap_evt_phy_update_request(p_ble_evt);
        } break;
        case BLE_GAP_EVT_PHY_UPDATE: {
            fd_ble_gap_evt_phy_update(p_ble_evt);
        } break;
        case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST: {
            fd_ble_gap_evt_data_length_update_request(p_ble_evt);
        } break;
        case BLE_GAP_EVT_DATA_LENGTH_UPDATE: {
            fd_ble_gap_evt_data_length_update(p_ble_evt);
        } break;
        case BLE_L2CAP_EVT_CH_SETUP_REQUEST: {
            fd_ble_l2cap_evt_ch_setup_request(p_ble_evt);
        } break;
        case BLE_L2CAP_EVT_CH_SETUP_REFUSED: {
            fd_ble_l2cap_evt_ch_setup_refused(p_ble_evt);
        } break;
        case BLE_L2CAP_EVT_CH_SETUP: {
            fd_ble_l2cap_evt_ch_setup(p_ble_evt);
        } break;
        case BLE_L2CAP_EVT_CH_RELEASED: {
            fd_ble_l2cap_evt_ch_released(p_ble_evt);
        } break;
        case BLE_L2CAP_EVT_CH_CREDIT: {
            fd_ble_l2cap_evt_ch_credit(p_ble_evt);
        } break;
        case BLE_L2CAP_EVT_CH_RX: {
            fd_ble_l2cap_evt_ch_rx(p_ble_evt);
        } break;
        case BLE_L2CAP_EVT_CH_TX: {
            fd_ble_l2cap_evt_ch_tx(p_ble_evt);
        } break;
        case BLE_L2CAP_EVT_CH_SDU_BUF_RELEASED: {
            fd_ble_l2cap_evt_ch_sdu_buf_released(p_ble_evt);
        } break;
        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST: {
            fd_ble_gatts_evt_exchange_mtu_request(p_ble_evt);
        } break;
        case BLE_GATTC_EVT_EXCHANGE_MTU_RSP: {
            fd_ble_gattc_evt_exchange_mtu_rsp(p_ble_evt);
        } break;
        default:
            break;
    }
}

