denisbohm/firefly-ice-firmware/src/nrf5/fd_ble_nrf5.c
void fd_ble_evt_dispatch(ble_evt_t const *p_ble_evt, void FD_UNUSED *p_context) {
    fd_ble_on_ble_evt(p_ble_evt);
}

void fd_ble_soc_evt_handler(uint32_t event_id, void *p_context);

// Register a handler for BLE events.
#define APP_BLE_OBSERVER_PRIO 1
NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, fd_ble_evt_dispatch, 0);

// Register handlers for SoC events.
#define APP_SOC_OBSERVER_PRIO 1
NRF_SDH_SOC_OBSERVER(m_soc_observer, APP_SOC_OBSERVER_PRIO, fd_ble_soc_evt_handler, NULL);

void fd_ble_stack_initialize(void) {
    uint32_t err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Configure L2CAP
    ble_cfg_t ble_cfg;
    memset(&ble_cfg, 0, sizeof(ble_cfg));
    ble_cfg.conn_cfg.conn_cfg_tag = APP_BLE_CONN_CFG_TAG;
    ble_cfg.conn_cfg.params.l2cap_conn_cfg.rx_mps        = 512; // BLE_L2CAP_MPS_MIN;
    ble_cfg.conn_cfg.params.l2cap_conn_cfg.rx_queue_size = rx_queue_size;
    ble_cfg.conn_cfg.params.l2cap_conn_cfg.tx_mps        = 512; // BLE_L2CAP_MPS_MIN;
    ble_cfg.conn_cfg.params.l2cap_conn_cfg.tx_queue_size = 10;
    ble_cfg.conn_cfg.params.l2cap_conn_cfg.ch_count      = 1;
    err_code = sd_ble_cfg_set(BLE_CONN_CFG_L2CAP, &ble_cfg, ram_start);
    APP_ERROR_CHECK(err_code);

    // Configure MTU MAX
    memset(&ble_cfg, 0, sizeof(ble_cfg));
    ble_cfg.conn_cfg.conn_cfg_tag = APP_BLE_CONN_CFG_TAG;
    ble_cfg.conn_cfg.params.gatt_conn_cfg.att_mtu = FD_BLE_GATT_ATT_MTU_MAX;
    err_code = sd_ble_cfg_set(BLE_CONN_CFG_GATT, &ble_cfg, ram_start);
    APP_ERROR_CHECK(err_code);

    // Configure the maximum event length
    memset(&ble_cfg, 0x00, sizeof(ble_cfg));
    ble_cfg.conn_cfg.conn_cfg_tag = APP_BLE_CONN_CFG_TAG;
    ble_cfg.conn_cfg.params.gap_conn_cfg.event_length = 320;
    ble_cfg.conn_cfg.params.gap_conn_cfg.conn_count = BLE_GAP_CONN_COUNT_DEFAULT;
    err_code = sd_ble_cfg_set(BLE_CONN_CFG_GAP, &ble_cfg, ram_start);
    APP_ERROR_CHECK(err_code);

    // Configure service changed
    memset(&ble_cfg, 0, sizeof(ble_cfg));
    ble_cfg.gatts_cfg.service_changed.service_changed = 1;
    err_code = sd_ble_cfg_set(BLE_GATTS_CFG_SERVICE_CHANGED, &ble_cfg, ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);
}

void fd_ble_disconnect(void) {
    if (fd_ble_conn_handle != BLE_CONN_HANDLE_INVALID) {
        sd_ble_gap_disconnect(fd_ble_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    }
}

typedef enum {
    flash_operation_result_none,
    flash_operation_result_pending,
    flash_operation_result_success,
    flash_operation_result_error,
} flash_operation_result_t;

volatile flash_operation_result_t fd_ble_flash_operation_result;

flash_operation_result_t fd_ble_flash_wait(void) {
    while (fd_ble_flash_operation_result == flash_operation_result_pending) {
    }
    flash_operation_result_t result = fd_ble_flash_operation_result;
    fd_ble_flash_operation_result = flash_operation_result_none;
    return result;
}

void fd_ble_flash_page_erase(uint32_t address) {
    do {
        fd_ble_flash_operation_result = flash_operation_result_pending;
        uint32_t page = address / 4096;
        uint32_t err_code = sd_flash_page_erase(page);
        APP_ERROR_CHECK(err_code);
        if (err_code != NRF_SUCCESS) {
            return;
        }
    } while (fd_ble_flash_wait() != flash_operation_result_success);
}

void fd_ble_flash_write(uint32_t address, const void *data, size_t length) {
    do {
        fd_ble_flash_operation_result = flash_operation_result_pending;
        uint32_t words = length / 4;
        uint32_t err_code = sd_flash_write((uint32_t *)address, data, words);
        APP_ERROR_CHECK(err_code);
        if (err_code != NRF_SUCCESS) {
            return;
        }
    } while (fd_ble_flash_wait() != flash_operation_result_success);
}

void fd_ble_soc_evt_handler(uint32_t event_id, void FD_UNUSED *p_context) {
    switch (event_id) {
        case NRF_EVT_FLASH_OPERATION_SUCCESS:
            fd_ble_flash_operation_result = flash_operation_result_success;
            break;
        case NRF_EVT_FLASH_OPERATION_ERROR:
            fd_ble_flash_operation_result = flash_operation_result_error;
            break;
        default:
            break;
    }
}

APP_TIMER_DEF(fd_ble_timer_id);

void fd_ble_timer_handler(void *context FD_UNUSED) {
    if (fd_ble_configuration->on_tick) {
        fd_ble_configuration->on_tick();
    }
}

void fd_ble_initialize(fd_ble_configuration_t *configuration) {
    fd_ble_configuration = configuration;

    for (uint32_t i = 0; i < configuration->channel_count; ++i) {
        fd_ble_l2cap_channel_t *channel = &configuration->channels[i];
        channel->read_available = false;
        channel->is_read_available = fd_ble_l2cap_channel_stream_is_read_available;
        channel->read = fd_ble_l2cap_channel_stream_read;
        channel->write_available = false;
        channel->is_write_available = fd_ble_l2cap_channel_stream_is_write_available;
        channel->write = fd_ble_l2cap_channel_stream_write;

        fd_ble_l2cap_channel_nrf5_t *channel_nrf5 = &fd_ble_channels[i];
        channel_nrf5->channel = channel;
        channel_nrf5->local_cid = 0;
    }
    fd_ble_channel_count = configuration->channel_count;

    fd_ble_flash_operation_result = flash_operation_result_none;

    APP_SCHED_INIT(32, 32);

    fd_ble_stack_initialize();
    fd_ble_gap_params_initialize();
    fd_ble_gap_initialize();
    fd_ble_l2cap_initialize();
    fd_ble_services_initialize(configuration->services, configuration->service_count);
    fd_ble_advertising_initialize();
    fd_ble_advertising_start();

    uint32_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
    err_code = app_timer_create(&fd_ble_timer_id, APP_TIMER_MODE_REPEATED, fd_ble_timer_handler);
    APP_ERROR_CHECK(err_code);
    err_code = app_timer_start(fd_ble_timer_id, APP_TIMER_TICKS(100), 0);
    APP_ERROR_CHECK(err_code);
}

void fd_ble_main_loop(void) {
    while (true) {
        app_sched_execute();
        uint32_t result = sd_app_evt_wait();
        APP_ERROR_CHECK(result);
    }
}

#endif
